[
  {
    "pdf_name": "MAI x WH360 - EN",
    "chunk_id": 0,
    "text": "ENTER THE ERA OF Wearable Intelligence ACHIEVE OPTIMAL PICK & STOW PROCESSES WITH MAXIMUM VISIBILITY AND PROCESS CONTROL Get in touch today and discover your Personalized ROI Reach out to info@proglove.comYour Wearable Companion with Advanced Analytics for Safer, Healthier, and Optimized Operations Empowering success with customer-centric solutions. The ProGlove solution combines MAI’s real-time worker guidance and Warehouse 360’s analytics to optimize fulfillment, enhance efficiency, and improve safety-seamlessly integrating with existing WMS and enterprise systems • Eliminate manual reports",
    "embedding_index": 0
  },
  {
    "pdf_name": "Post and Parcel Use Cases Flyer",
    "chunk_id": 0,
    "text": "| USE CASES FLYER Sorting is the major task at post and parcel services. Highly automated and commonly executed by robots and sorting machines. Whenever it comes to bulky goods like ironing boards, TV’s or a new batch of pet food these robots reaching their boundar- ies and the bulky goods sorting is still a manual task – elaborated by the human workforce. The booming e-commerce business leads to a steep increase to an already fluctuating overall shipment volume. DHL needs to address this increase whileworking with the same size areas in its parcel centers. PARCEL & POSTAL USE CASES MARK Display MARK mid range MARK mid range SORTING PROCESS BENEFITS1.Parcels arrive by truck and are transferred to the sorting facility (rough pre-sorting) 2. Parcels are now sorted by the system into different ﬁngers (12 tours per ﬁnger) 3. Each parcel gets scanned by the employee with the MARK Display, which show him the tour and the sorting place 4. Employee puts the parcel at the corresponding placebetter quality • Sorting information right at the ﬁngertips, at a glance • Robust scanner, mobile device can stay in the pocket, less repair issues“ ”MARK Display is light and robust at the",
    "embedding_index": 1
  },
  {
    "pdf_name": "Post and Parcel Use Cases Flyer",
    "chunk_id": 1,
    "text": "same time with showing us only the relevant information we need. It’s the best fit for our use case. useful insights • Gaining process insights with integration into the Insight Platform • More accurate planning for shift schedule • Easy integration into the systemRemo Hess, Teamleader Depot Application IT, DPD Switzerland AG | USE CASES FLYER time saving • Process is more efﬁcient • Before: check membership + sort: 3min • After: scan + sort: 1min • Productivity increases of 20% Less time to record the stop Relevant data is available Fewer errors, easier onboarding Employee places the parcel in the respective dolley SORTING PROCESS BENEFITS1.Reception of inbound Chronopost bags at the dock 1 and packed by the driver 2. Opening of the bags thanks to the bags’ lift, already prioritizing postal codes 3. Sorting and shipping the products at the right handling locations 4. Scanning and sorting Chronopost product by the operators equipped with ProGlove (one for depart- ment 29 and two for depart- ments 35/53), considering the parcel’s size time saving • Average stopwatch volume: 800 • Before: scanning then sorting: 120min • After scanning and sorting: 80min, 40min/day saved “ ”All workers are satisfied about the product’s",
    "embedding_index": 2
  },
  {
    "pdf_name": "Post and Parcel Use Cases Flyer",
    "chunk_id": 2,
    "text": "lightness, as well as the different type of wearables; perfectly adapted to their daily operations. less lifting • 800 parcels of 5kg, carried once instead of twice = 4000kg/night less • Scanners lightweight: 200g less per/task Less repetitive tasks More ergonomics and recognition Jean-Claude Baron, Responsable Technique Supports Sécurité Sûreté, La Poste Solution rolled out by our partner integrator Isitec International SORTING PROCESS BENEFITS1.Bulky goods are delivered unsorted in an inbound container 2. Associate scans article and receives shipment information 3. Associate places article in the destination container according to the postal code better ergonomics • 100% mobile associate due to wearable technology • 100% hands free in all process steps with ProGlove • 95% user acceptance with best in class ergonomics “ ”Thanks to the Bulky Goods 2.0 and ProGlove projects we are no longer tied to stationnary processing stations but can process bulky goods anywhere in the hall. better efficiency • Signiﬁcant improvement in efﬁciency (+ 30%) • Dynamic adaptability of seasonal deviations Werner Kunert, Deputy Head of Warehouse “ ”I am no longer forced to wait for the feeder and can start processing at the point where the bulky goods arrive. Jens Klostermann, Bulky Baggage Handler Contact",
    "embedding_index": 3
  },
  {
    "pdf_name": "Post and Parcel Use Cases Flyer",
    "chunk_id": 3,
    "text": "us: sales@proglove.com For more information: www.pr oglove.com @2020 Workaround GmbH All rights reserved. ProGlove is a trademark of Workaround GmbH. Pricing, specifications, and design are subject to change without notice. Scanner, smartphone, or tablet sold separately. All brand, product, service names, and logos are trademarks and/or egistered trademarks of their respective manufacturers and companies. ProGlove builds the lightest, smallest, and toughest barcode scanners in the world, connecting workers to actionable information. More than 500 renowned organizations in manufacturing, production, logistics, and retail use these smarter workforce solutions. ProGlove was founded in December 2014 after winning the Intel „Make it Wearable“ Challenge in Silicon Valley and is backed by growth-fo - cused investors Summit Partners, DICP , and Bayern Capital. ProGlove employs 200 people from over 40 countries with offices in Munich, Chicago, and Belgrade. More information is available at: www.proglove.com.| USE CASES FLYER",
    "embedding_index": 4
  },
  {
    "pdf_name": "ProGlove_Wearable Scanner Overview_EN",
    "chunk_id": 0,
    "text": "Wearable Scanner Family Compatible with your OS (Android, Windows, Linux, iOS) Human-centered design makes it easy to wear all day and easier to useChoose between a display, scan ranges, and your operational needs Smallest and lightest wearable scanners on the market Save up to 6 seconds per scan, right away All scanners can be paired with any of the 3 wearables variations Scan the QR Code or contact us for more information: info@proglove. com www.proglove.comProGlove ProGloveGET IN TOUCH 50 x 45 x 17 mm 35g 50 x 45 x 17 mm 39g 50 x 45 x 17 mm 39g50 x 45 x 16 mm 40g50 x 45 x 18 mm 48gDimensionsMARK Display Range Ruggedness Battery Temperature STANDARD RANGE 10 cm - 90 cm LED dot aiming 50 drops from 2m IP547,000 scans* 2h charging time0°C – 50°C *Battery life and barcode readability depends on device settings, usage, and many other factors. MID RANGE 30 cm - 150 cm Laser aiming STANDARD RANGE 10 cm - 90 cm LED dot aiming100 drops from 2m IP5412,000 scans* 2h charging time-20°C – 50°C MID RANGE 30 cm - 150 cm Laser aiming STANDARD RANGE 10 cm - 90 cm LED dot aiming 0°C",
    "embedding_index": 5
  },
  {
    "pdf_name": "ProGlove_Wearable Scanner Overview_EN",
    "chunk_id": 1,
    "text": "– 50°C MULTI RANGE 10 cm - 250 cm Laser aimingMARK 2 100 drops from 2m IP6512,000 scans* 2h charging time-20°C – 50°C MULTI RANGE 10 cm - 600 cm Laser aimingMARK 3 MARK Basic 50 drops from 2m IP548,000 scans* 2h charging time STANDARD RANGE 10 cm - 70 cm LED dot aiming30 drops from 2m IP434,000 scans* 1h charging time0°C – 50°CLEO Guidance - Optic, acoustic, haptic feedback Sensor - Scan events, Movement, Device metadata Connectivity - BLE, ProGlove INSIGHT",
    "embedding_index": 6
  },
  {
    "pdf_name": "CS_SPAR_EN",
    "chunk_id": 0,
    "text": "CASE STUDY • Lower error rate in the picking process • Minimization of employee training • More efficient, ergonomic processes • Improved employee satisfaction and retention • Increase in overall performance by up to 15%.NUMBERS PROGLOVE customer since 5 of 9 Warehouses/distribution centers in Austria Order picking: 200 300 2021 PROGLOVE devices in use RESULTSINDUSTRY RetailPROGLOVE SOLUTION Wearable Scanner MARK Basic, MARK 2 and MARK Display incl. integration into WMSAPPLICATION AREAS Logistics: goods receiving and picking for stores and e-commerceSPAR achieves a 15% improvement in productivity with ProGlove scans per hour up to The SPAR Austria Group operates food and sports retail stores, and shopping centers in Austria and 7 neighboring countries. They also have a burgeoning e-commerce business. Gross sales of the entire group grew by a total of +4.7% to 17.37 billion euros in 2021. SPAR was particularly successful in Austria, where it further extended its market leadership in food retailing with sales revenue of € 8.63 billion (+3.9%). In total, the SPAR Austria Group employs over 90,000 people. In Austria, SPAR is the largest private Austrian employer with more than 50,000 employees. SPAR is also setting new standards in many other areas - for example, in store",
    "embedding_index": 7
  },
  {
    "pdf_name": "CS_SPAR_EN",
    "chunk_id": 1,
    "text": "architecture, product range design, logistics ,and marketing - with the aim of achieving its vision of becoming an Austrian trading company and a Central European trading group and taking the SPAR brand even further forward.About SPAR Austria If SPAR is to achieve its plans for growth, it’s logistics and distribution must become significantly more productive. At five of its nine distribution centers in Austria, and most notably at its new central warehouse for fresh products in Vorchdorf, SPAR is using ProGlove's wearable scanners to streamline the picking process and provide employees with \"tangible results\" in the areas they care most about – the speed, ease, and accuracy of the scanning process; the reduced chances of injury or error. With the ProGlove wearable scanners, employees have their hands free at all times to safely lift goods and packages. All barcodes are captured and processed faster than ever before. On the integrated display of the scanners, employees always have the necessary picking instructions in view and are systematically guided through the process. This minimizes the error rate and contributes overall to employee satisfaction and loyalty.SummaryCASE STUDY SPAR is facing a number of serious challenges to its growth plans. • Customer demand is",
    "embedding_index": 8
  },
  {
    "pdf_name": "CS_SPAR_EN",
    "chunk_id": 2,
    "text": "high and product diversity is increasing. They must maintain, if not increase customer satisfaction • Like most retail companies, SPAR is struggling with employee turnover and the fact that qualified staff is currently hard to find. • However, logistics must run smoothly and efficiently as a core factor of a functioning supply chain. • Nevertheless, the quality of the picking processes must be maintained in order to supply stores and e-commerce customers correctly and quickly. • Multiple picking for different stores on one picking vehicle is a source of errors, because employees easily mix up the correct container. Challenge at SPAR MATTHIAS KIENZL Head of Goods Flow and Warehouse Management, SPAR Austria \"From the very first appointment with ProGlove, we were immediately convinced by the innovative scanner solutions. After successful tests in different scenarios, we were quickly convinced of the increased efficiency and high acceptance among employees. We are definitely impressed by the unique ergonomics.\" Display directly on the back of the hand The picking carts that the pickers use to go through the shelves contain the boxes for the orders from the different stores. Up to 200 different products per hour are \"picked\" into these boxes. The pickers are",
    "embedding_index": 9
  },
  {
    "pdf_name": "CS_SPAR_EN",
    "chunk_id": 3,
    "text": "completely mobile have their hands free to safely and quickly remove the goods from the shelves and place them in the respective box. CASE STUDY Speed and quality count The SPAR stores receive their fresh food daily from the warehouse in Vorchdorf. In the future, deliveries will be made twice a day to guarantee the freshness. This means a high turnover of goods, which requires fast and precise scanning in the warehouse. Currently, 40 employees are working in Vorchdorf using around 150 ProGlove scanners. Soon the number of employees will be increased to 80, the target is 120. SPAR Austria organizes its logistics centers by region. ProGlove is used for both in-store supply and e-commerce. Like most retailers, SPAR started to expand e-commerce during the Corona pandemic. The company offers both home delivery and in-store pickup. Employees are tasked with going through the shelves in the supermarket to find and scan the goods the customer has ordered. ProGlove’s MARK Basic scanners display the customer’s order on a terminal mounted on the picking cart. Afterwards, they are either packed for shipping or deposited in a pickup box in the front of the store.Areas of application for ProGlove at SPAR Austria Use",
    "embedding_index": 10
  },
  {
    "pdf_name": "CS_SPAR_EN",
    "chunk_id": 4,
    "text": "Case 1: In-store picking for e-commerce Example: new central warehouse in Vorchdorf The 6 regional distribution centers/warehouses are conveniently located in Austria. They are each located in the provinces in which they supply stores. The new central warehouse in Vorchdorf was recently put into operation. With more than 6,000 m² of refrigerated space, capacity has been created here to sustainably handle the warehousing and distribution of refrigerated goods for all of SPAR. Use Case 2: Picking for store delivery CASE STUDY SPAR sets new standards in logistics with cutting-edge technology ProGlove’s innovative technology brings SPAR information from the shop floor that is used to better understand and significantly improve workflows. All this new data is available to, and integrated with the SPAR Warehouse Management System, enabling the connection to and comparison between order, display and store box in the background. This was jointly developed so that exactly the required fields and categories are displayed.Each box has its own label. This is linked to the display so that the employee can always directly determine whether the right item has been placed in the right box. This is an important quality step that ensures that the correct goods are delivered to the",
    "embedding_index": 11
  },
  {
    "pdf_name": "CS_SPAR_EN",
    "chunk_id": 5,
    "text": "stores. After each scan, the check and confirmation on the display are automatic. Each employee has a ProGlove Scanner MARK display on the back of their hand. The scanner's display shows the storage location, the item description, the quantity, and the route. Free hands, full mobility ProGlove has significantly reduced the physical demands on the workers while increasing the speed and accuracy of the scanning process. The lightweight, wearable devices give workers free and full range of motion, and there is no need to pick up and put down additional devices over and over again. Plus, the interactive display on the scanners brings information to the workers no matter where they are on the shop floor. Feedback on scans (e.g., OK / NOK) are received optically, haptically, and acoustically, eliminating unnecessary interruptions and guiding workers through the picking process faster. CASE STUDY Improving ergonomics and attracting employees Vorcfhdorf’s central local has made it the logical choice for distribution centers and logistics hubs, not just for SPAR, but also for many of SPAR’s most important competitors. The ongoing competition for qualified workers is fierce. With pay and benefits roughly equal, any improvement to the working environment has become a distinct advantage",
    "embedding_index": 12
  },
  {
    "pdf_name": "CS_SPAR_EN",
    "chunk_id": 6,
    "text": "in both recruiting and retaining workers. The introduction of ProGlove’s ergonomic, lightweight, wearable barcode scanners is seen by workers as a meaningful and attractive benefit, giving them freedom of movement and safety on the shop floor. Workers and management are both enthusiastic about these faster, more accurate, hands-free scanners. The working environment is vastly improved, worker satisfaction is up, and productivity is on the rise. This new warehouse in Vorchdorf is used as a showcase for the entire Austria Group, testing new ideas and new technologies. Other warehouses and logistics centers are studying the advances achieved with ProGlove and are planning to start using the devices as well. In addition, the ProGlove scanners are already being used successfully in SPAR’s online wine store, Weinwelt.at . Customers order beverages and supplies which are conveniently delivered to their homes. The ProGlove MARK Basic and MARK 2 scanners are used both for storing the wine on the shelves and for picking for the stores and customers. The individual bottles are removed from the shelves and repacked. This is where the wearables are particularly beneficial, as employees can lift and pack the beverage bottles and packages much more easily, securely, and safely with two",
    "embedding_index": 13
  },
  {
    "pdf_name": "CS_SPAR_EN",
    "chunk_id": 7,
    "text": "hands.Use Case 3: Wine World CASE STUDY Based on the success of the project in Austria, the Group is considering introducing the MARK devices into its locations in Hungary, Slovenia and Italy. Initial tests are already underway. The rollout is planned for 2023. In addition, SPAR is currently testing the MARK 3 multi-range scanner, which covers greater distances and ranges, and is therefore particularly suitable for use in combination with the forklifts and vehicles in SPAR warehouses. As the fastest, lightest and most versatile solution, MARK 3 optimizes hands-free scanning within the supply chain and guarantees high scanning speed as well as a smooth and flexible workflow even from a forklift.Outlook",
    "embedding_index": 14
  },
  {
    "pdf_name": "Case Study_Book Depot Inc_EN",
    "chunk_id": 0,
    "text": "CASE STUDY NUMBERS PROGLOVE customer since 1 warehouse 538.195 sq ft / sqm 500,000 Number of shipped parcels / days 5,500 average 1462021 PROGLOVE devices in use INDUSTRY RetailPROGLOVE SOLUTION LEO, MARK Display, MARK 3, Hand Strap, Index Trigger, GatewayEnhancing Speed, Efficiency, and Accuracy with ProGlove at Book Depot 11,000 peak season Book Depot Inc., a leading wholesaler and retailer of bargain books, has a strong presence throughout North America. With various brands under its umbrella, including Book Depot, Book Outlet, Kidsbooks, and Spark Book Fairs, the company handles a high volume of books daily, making maximum productivity crucial for their operations. Their mission is to enchant the mind, one book at a time, while ensuring their customers receive top-quality service. About Book Depot Inc. The implementation of ProGlove at Book Depot yielded remarkable outcomes, enhancing speed, efficiency, and accuracy across their operations. The company experienced significant enhancements that sparked a positive transformation in their workflows, which remains an ongoing focus for continuous improvement.Summary CASE STUDY Book Depot identified areas for improvement in their day-to-day operations, particularly in optimizing employee safety and streamlining workflows. They acknowledged that outdated handheld scanners and netbooks were impeding team members' mobility and efficiency during",
    "embedding_index": 15
  },
  {
    "pdf_name": "Case Study_Book Depot Inc_EN",
    "chunk_id": 1,
    "text": "the shelf picking process, resulting in longer takt time and suboptimal workflows. In particular, ensuring the safety of employees working at heights of up to 7.5 meters was of utmost importance. To attain their objectives of speed, efficiency, accuracy, and safety, Book Depot sought a solution that would optimize processes and elevate worker productivity.Challenge at Book Depot Inc. KEVIN Operations Manager, Book Depot Inc. \"ProGlove has truly made a positive impact on our business, elevating our speed, efficiency, and accuracy. With this technology, we can carry out our mission of enchanting the mind one book at a time with even greater precision. Its implementation not only enables us to achieve our goals more efficiently but also reinforces our commitment to delivering top-quality service to our valued customers.\" Areas of application for ProGlove at Book Depot Inc. With the introduction of ProGlove, Book Depot experienced a remarkable reduction in takt time. In the receiving area, where thousands of books are processed daily, the ProGlove MARK 3 enabled the team to scan items from inside the forklift, eliminating the need for separate handheld scanners. This simplified their daily routine and reduced takt time by up to 8 seconds per carton, allowing for",
    "embedding_index": 16
  },
  {
    "pdf_name": "Case Study_Book Depot Inc_EN",
    "chunk_id": 2,
    "text": "faster processing and improved productivity. Prioritizing employee safety, Book Depot adopted MARK 3 in their bulk inventory management system. This implementation proved to be a game- changer for workers who operated at heights of up to 7.5 meters. The ability to scan quickly and reliably from a distance, while freeing both hands, empowered operators to remain within the machine's boundaries and maintain focus. As a result, their safety while working at elevated heights was ensured.Use Case 1: MARK 3 for forklifts & heightsCASE STUDY The shelf picking process underwent a major transformation with the integration of ProGlove's LEO scanner. Designed specifically for nearfield scanning tasks, it replaced the outdated wedge scanners previously used. The introduction of tablets instead of netbooks increased the mobility and flexibility of the staff, while also streamlining the process and reducing the number of steps required. As a result, Book Depot achieved an impressive 4-second reduction in takt time per scan, significantly improving overall efficiency. In the auto sortation area, the ProGlove LEO scanners proved to be invaluable. These advanced devices enabled team members to work hands- free, scanning barcodes at the destination and seamlessly pairing them with the corresponding cartons. As a result, takt time",
    "embedding_index": 17
  },
  {
    "pdf_name": "Case Study_Book Depot Inc_EN",
    "chunk_id": 3,
    "text": "was reduced by four seconds per assigned tote, streamlining the sorting process and ensuring efficient order fulfillment. Additionally, MARK Display helped them quickly verify customer ID and destination and provided quick troubleshooting capabilities for customer orders that required extra attention, further enhancing accuracy and customer satisfaction. Use Case 2: LEO, fastest scanner CASE STUDY The introduction of ProGlove MARK Display in the shipping process, proved instrumental. This lightweight and slim technology, comfortably worn on the back of employees' hands, seamlessly integrated into their tasks of preparing books for shipment. The integration resulted in a remarkable reduction of 8 seconds per package in takt time. As a result, Book Depot gained the ability to ship thousands of additional units daily, ensuring swift and precise order fulfillment to meet customer demands.Use Case 3: MARK Display The implementation of ProGlove at Book Depot brought about remarkable results, enhancing speed, efficiency, and accuracy across operations. Takt time saw a significant reduction of up to 18%, while the capacity for order handling was greatly improved. The streamlining of workflows and simplification of processes eliminated the need for outdated scanners. ProGlove not only improved worker safety through hands-free scanning but also optimized overall operations, aligning perfectly",
    "embedding_index": 18
  },
  {
    "pdf_name": "Case Study_Book Depot Inc_EN",
    "chunk_id": 4,
    "text": "with Book Depot's unwavering commitment to delivering quality service.Outlook",
    "embedding_index": 19
  },
  {
    "pdf_name": "Automotive_Brochure_2023_EN",
    "chunk_id": 0,
    "text": "Innovating human-centered productivityAUTOMOTIVE • Demand is accelerating 3 • 3 challenges that are driving the need for warehouse productivity 4 • Productivity starts with ProGlove 6 • Safer, less stressful, more productive work environment 8 • Enhanced mobility 9 • ProGlove optimizes warehouse processes 10 • Assembly line 11 • Sequencing 12 • Staging 13 • Picking 14 • Incoming goods/outgoing goods 15 • CKD-Packaging 16 • ProGlove Success Story 17 • Audi Success Story 18 • Volkswagen Success Story 19 • Mercedes Benz Vans Success Story 20 • Kickstart your productivity 21CONTENT 3Demand is accelerating The automotive industry is in a transformative era, where the status quo is being redefined by emerging requirements for productivity. With the introduction and wide acceptance of electric vehicles and the po - tential of autonomous vehicles on the immediate hori - zon, manufacturers are facing new demands that en - compass technological integration, sustainability, and increased connectivity. The call for efficient and flexi - ble production processes is more pressing than ever, as automakers strive to meet evolving consumer pref - erences and stringent regulatory standards. Equipping warehouses and logistics centers to meet these demands requires innovation: new thinking; new tools; and new",
    "embedding_index": 20
  },
  {
    "pdf_name": "Automotive_Brochure_2023_EN",
    "chunk_id": 1,
    "text": "solutions. Productivity must increase exponentially. Existing technology is simply not up to the task and has nothing left to offer. Revolutions, such the dark warehouse, are many years away. Warehouse operations needs answers today. 43 challenges that are driving the need for warehouse productivity 1. The incredible range of products. As the makes and types of vehicles so does the volume and range of the component parts, positing a significant challenge to automakers and suppliers alike. Managing an extensive range of options requires substantial resources, increased production complexity, and a delicate balance between meeting consumer demands and maintaining cost- efficiency. Forecasting and managing the global supply chain can be a nightmare. 2. The aftermarket is exploding, evolving from single independent locations, to national chains of stand-alone outlets, to eCommerce-only parts. Retailers must offer tens of thousands of SKUs. Delivering the right item to the right place at the right time is essential. As demand, complexity, and competition increase, so do the challenges. 4 5 53. An unprecedented labor shortage. This includes both skilled workers and professionals. The shortage of labor is not only limited to the warehouse and assembly line, but also affects engineers, designers, and other technical roles. Both",
    "embedding_index": 21
  },
  {
    "pdf_name": "Automotive_Brochure_2023_EN",
    "chunk_id": 2,
    "text": "retention and recruitment are suffering. This shortage leads to delays in production, increased labor costs, and a decrease in overall productivity. 6Productivity starts with ProGlove ProGlove’s innovation solves today’s productivity problems today delivering immediate and significant improvements to processes and overall warehouse performance. Adoption of ProGlove’s lightweight, ergonomic barcode scanners is almost instantaneous - it is almost instinctual. Notably, our devices enjoy a 90+% worker satisfaction rating. 7 CUSTOMERS REPORT 27% increase in productivity33% reduction in errors 6 seconds saved per scan 7 8ProGlove scanners are lightweight, ergonomically designed, and wearable. Which means that workers always have both hands free, all the time. The repetitive motion required for handheld scanners is gone, as is the weight. Whether on the floor, a ladder or a forklift, workers are safer and less stressed. Safer, less stressful, more productive work environment 8ProGlove’s clear ergonomic value translates into reduced physical strain and improved worker comfort, ultimately enhancing productivity and satisfaction. Moreover, hands- free documentation minimizes distractions and allows workers to fully concentrate. Our wearable scanners create a safer working environment and reduce the risk of accidents or errors. ProGlove wearable scanners facilitate continuous workflows, leading to improved process quality and simpler documentation. By seamlessly",
    "embedding_index": 22
  },
  {
    "pdf_name": "Automotive_Brochure_2023_EN",
    "chunk_id": 3,
    "text": "integrating with existing systems, our scanners streamline the documentation process. The devices provides real-time guidance and feedback to workers, ensuring they follow the correct procedures and reducing the risk of errors or inconsistencies. 9 Enhanced mobility With our wearable scanners, workers can stay on the move and accomplish more in less time, ultimately boosting the productivity and effectiveness of the entire workforce. Our wearable scanners are designed to optimize mobility by allowing workers to move freely between stations and throughout the plant. By eliminating the constraints of traditional scanning methods or stationary workstations, our devices enable workers to carry out their tasks with greater flexibility and adaptability, and transition between different job sites or workstations without wasting time on unnecessary walks or delays. Additionally, new data from the shop floor, available with ProGlove scanners, provides information to streamline all processes and layout. 10ProGlove optimizes automotive and after-sales processes 1 2 3Assembly line Staging Sequencing/Kitting 4 5 6Picking Incoming goods/Outgoing goods CKD-Packaging PRODUCTIONPRODUCTIONPRODUCTION PRODUCTIONPRODUCTIONPRODUCTION AFTER-SALES AFTER-SALES 11Assembly line1 Challenge Assembly lines are meant to move fast, which means that the parts and kits must be there, ready and accurate, when needed. Not a moment before and certainly not a moment after.",
    "embedding_index": 23
  },
  {
    "pdf_name": "Automotive_Brochure_2023_EN",
    "chunk_id": 4,
    "text": "It is essential that all the processes that come before are optimized. Errors and bottlenecks will stop the line, with repercussions throughout the organization. Solution Introducing ProGlove’s hands-free, lightweight, ergonomic barcode scanners dramatically increases the speed and accuracy of all processes feeding the assembly line. No need to pick up and replace heavy, hand-held scanners. Operations can be assured of faster throughput, no matter the size, number, or complexity of component parts.Benefits Savings per assembly line: 1:27 min / car 203,620 € / year Adopted by 11 1212Sequencing2 Challenge Sequencing is managing the precise order of components for assembly, while constantly adapting to the individual vehicle requirements, and the pace of customer demand. The layout of sequencing stations within the warehouse requires the operator to move to different locations. Manual sequencing processes are time-consuming and prone to errors, leading to production delays. Solution ProGlove wearable barcode scanners facilitate the always-changing requirements of sequencing with a dynamic pairing option, allowing workers to switch sequencing stations without switching scanners. Workers receive real-time sequencing information and instructions via two-way communications, ensuring accurate and efficient process flow.Benefits 6 seconds faster per scan Adopted by 13 13Staging3 Challenge The success of staging depends on maintaining",
    "embedding_index": 24
  },
  {
    "pdf_name": "Automotive_Brochure_2023_EN",
    "chunk_id": 5,
    "text": "inventory visibility, optimizing layout, and thus minimizing handling time, effort, and cost. Solution Introducing ProGlove’s hands-free, lightweight, ergonomic barcode scanners dramatically increases the speed and accuracy of all processes feeding the assembly line. No need to pick up and replace heavy, hand-held scanners. Operations can be assured of faster throughput, no matter the size, number, or complexity of component parts.Benefits 4 seconds faster per scan Adopted by 1414Picking4 Challenge Storing, finding, and retrieving components from high racks with a forklift is a reality of warehouse operations. Workers often struggle with handheld scanners while maneuvering the forklift, which can lead to errors, decreased productivity, damaged products, and safety concerns. Solution ProGlove allows operators to wear the scanner and effortlessly scan barcodes while keeping their hands free to operate the forklift and pick parts with both hands. This hands-free approach enhances accuracy, improves efficiency, and enhances worker safety. Benefits 5 seconds faster per scan 50 less wrong scans / 1000 scans Adopted by 15 15Incoming goods/ outgoing goods5 Challenge Receiving and Shipping - the first and the last touchpoint of warehouse operations are crucial steps in the value chain. Workers often need to juggle tools, handheld scanners, documents, and components at the",
    "embedding_index": 25
  },
  {
    "pdf_name": "Automotive_Brochure_2023_EN",
    "chunk_id": 6,
    "text": "same time, leading to potential errors and delays in updating inventory records. Solution Workers using ProGlove scan barcodes on incoming and outgoing goods without the need for additional devices, ensuring real-time inventory updates, and seamless integration with production schedules. Additionally, taking a photo with the same device, cuts process time. Benefits Savings: 18 seconds / package Adopted by 1616CKD-Packaging6 Challenge Complete Knock Down (CKD) shipments require 100% process compliance. Bulky handheld devices slow the documentation process while assembling and packaging components, leading to delays, inaccuracies, and inefficiencies. Solution Ergonomic, wearable, accurate ProGlove scanners enable workers to perform necessary tasks quickly, with substantially less effort, while accessing real-time instructions via two- way communications. Benefits 4 seconds faster per scan Adopted by 17 ProGlove Success Story 18Challenge AUDI needed to demonstrably increase the speed and accuracy of barcode scanning as the basis for boosting the efficiency and effectiveness of all warehouse processes. Specifically, in the CKD process, different parts are commissioned and packed in bigger cardboard boxes for shipments Solution ProGlove’s wearable devices made it easier for shipments to be verified and processed, and caused a more intuitive workflow providing immediate improvements in order accuracy and speed of assembly. Result Packing was",
    "embedding_index": 26
  },
  {
    "pdf_name": "Automotive_Brochure_2023_EN",
    "chunk_id": 7,
    "text": "streamlined with easy handling regardless of order volumes. Audi \"Workers no longer have to reach around and fetch a scanner from another position. ProGlove scanners are wearable and accurate, and enable fluid, uninterrupted processes.\" HARTMUT BARTSCH Head of CKD Packing, AUDI 19 \"We chose ProGlove scanners because the devices worked flawlessly during the pilot. Implementation was easy and our employees are very satisfied.\" DOMINIK BIRTH-RUSZCZYNSKI Head of Lean Logistics and Technology, Volkswagen Volkswagen Challenge Volkswagen is one of the largest car manufacturers in the world, with millions of picks per day across distribution centers, assembly processes, and aftersales logistics sites. They have a need for absolutely accurate and efficient tracking of original parts and accessories at all stages of receiving, production, and shipping. Solution Volkswagen looked to ProGlove’s devices to deliver on process quality, while directly influencing efficiency gains and improving the overall shop floor experience. Result With ProGlove, Volkswagen has been able to save between two and four seconds per pick and is continuing to roll out these hands-free scanners to more processes and sites. Saving even two seconds, and maybe four seconds per scan, translates into significant productivity gains with enormous ROI implications. 20Mercedes Benz Vans Challenge Mercedes-Benz",
    "embedding_index": 27
  },
  {
    "pdf_name": "Automotive_Brochure_2023_EN",
    "chunk_id": 8,
    "text": "Vans needed an accurate and efficient way to identify issues (such as inefficiencies and bottlenecks), update methods of tracking, and improve productivity across all stages of its extensive logistics operations. Solution By deploying ProGlove's wearable scanners, Mercedes-Benz Vans drove its digital transformation and collected the high impact they were looking for. MARK Display’s screen features were particularly helpful to reduce the time operators spent standing in front of a shelf to manually compare item numbers. In combination with our ProGlove Insight software, they are able to detect issues faster and streamline operations. Result Mercedes-Benz Vans builds hundreds of vehicles per day with some 1,000 scans per car. A minimum of four seconds saved per scan makes for substantial productivity gains. Building on this success, they are in the process of bringing ProGlove technology to 21 Mercedes-Benz Vans sites. RONJA JAKOBI Logistics Planner, Mercedes-Benz AG \"Thanks to ProGlove, we made our logistics processes more digital and efficient. We also increased acceptance among workers by significantly improving ergonomics and simplifying processes. By using ProGlove's Insight software platform, we will also be able to measure these improvements on the shop floor.\" 21Kickstart your productivity Take the ProGlove Challenge info@proglove.com www.proglove.comLet us show you,",
    "embedding_index": 28
  },
  {
    "pdf_name": "Automotive_Brochure_2023_EN",
    "chunk_id": 9,
    "text": "in your environment, the kind of productivity ProGlove delivers. 30 minutes, on your shop floor with your workers, our scanners vs yours. We call it the ProGlove Challenge. There’s very little to lose and a lot of productivity to gain. 21",
    "embedding_index": 29
  },
  {
    "pdf_name": "CS ASICS_EN (Not allowed to use on social)",
    "chunk_id": 0,
    "text": "CASE STUDY • Reduced error rate in picking • 15% - 20% improvement in employee performance • Increase in employee satisfaction and retention • 27% Improvement in overall process efficiency NUMBERS ProGlove customer since In Germany more than 250 logistics employees 2020 >60 Use of MARK scanners in Germany and FranceRESULTSINDUSTRY Consumer GoodsPROGLOVE S OLUTION Wearable Scanner MARK 2 ASICS relies on ProGlove for: • packing stations • returns • order picking • High racks in combination with forklift27% increase in productivity in ASICS’ European Distribution Center Retail 75,000 m2 warehouse space ASICS is a global athletic footwear and apparel brand founded in 1949 in Japan. The company name is an acronym of \"Anima Sana In Corpore Sano\" (A healthy mind in a healthy body) . The company's mission is to \"Create Quality Lifestyles through Intelligent Sports Technology\". ASICS is one of the top ten sportswear manufacturers with global sales of around 3.1 billion euros (2021). The company operates 1,900 stores worldwide and employs about 8,900 people.About ASICS More than ever, the retail industry needs speed and flexibility to ensure smooth multichannel delivery to customers. To meet the needs of an ever- changing market environment, ASICS is testing and embracing",
    "embedding_index": 30
  },
  {
    "pdf_name": "CS ASICS_EN (Not allowed to use on social)",
    "chunk_id": 1,
    "text": "innovative technologies in its European Distribution Center (EDC) in Germany, and its Southern European Distribution Center in France. Every shipment that leaves the distribution center must be correct and on time, every single time. Therefore, scanning must be fast and accurate. ASICS has been able to optimize its picking and returns processing by making logistics faster, easier, and more accurate with ProGlove wearable scanners. SummaryCASE STUDY Customer satisfaction, and the company's brand promise hinge on the ability to deliver on-time and in-full (OTIF), every single time. Consistency has been a challenge as ASICS has had to deal with rising labor costs, turnover, increasing demand, and supply chain issues. In this multichannel environment, distribution centers support both ASICS stores (B2B) and online orders (B2C). ASICS previously used conventional barcode scanners, which were heavy and were not designed ergonomically. They also required awkward movements for repetitive tasks, which slowed the process and increased the possibility of injury. Complete visibility into and control of the scanner fleet was a key concern as ASICS also needed to avoid downtime and expenses caused by broken, uncharged, or lost devices. Therefore, the company needed a solution that could provide reliable data on the location, condition, and",
    "embedding_index": 31
  },
  {
    "pdf_name": "CS ASICS_EN (Not allowed to use on social)",
    "chunk_id": 2,
    "text": "battery status of all the scanners.Challenge at ASICS ASICS operates according to the Japanese Kaizen principle of continuous improvement. Thus, they focuse heavily on the quality of operations, including the distribution centers. There, the focus is on continuously monitoring the processes in order to continually improve. They looked to technological innovation to increase their visibility into warehouse operations.Improving quality CASE STUDY ASICS, like so many retail companies, also has difficulty recruiting and retaining qualified personnel. They have learned that the working environment is an issue central to worker satisfaction. That's why the company was very interested in finding an ergonomic solution for its many scanning processes. A safer working environment which requires less exertion to complete the assigned tasks is much more pleasant and attractive, and positively influences word of mouth.Attracting and retaining employees Needing an innovative solution to barcode scanning, ASICSS looked to state-of-the-art technology to increase both speed and efficiency. It’s important to understand that their picking process consists of low runners (items that do not have to be picked often) , and high runners which are picked frequently during the day and must be shipped quickly. The picking of low runners is therefore fully automated with robots.",
    "embedding_index": 32
  },
  {
    "pdf_name": "CS ASICS_EN (Not allowed to use on social)",
    "chunk_id": 3,
    "text": "However, the situation is different for high runners. They have to be picked frequently during the day and shipped quickly. This requires a higher speed than the robots can provide and so is accomplished by the employees because they are much more agile. ProGlove's lightweight, wearable scanners are completely hands free, allowing workers to scan goods or packages much faster and more ergonomically. ProGlove in use at ASICS\"To meet the major challenges of the new retail and e-commerce landscape and live up to our principle of continuous improvement, we are always looking for innovative solutions that improve our efficiency and make us even more attractive as an employer. With ProGlove, we have succeeded in doing both. The work ergonomics of our employees have improved significantly and we have been able to increase our process efficiency in the packing process by an incredible 27%.\" MICHAEL GRYSZKO-PRATTES , Director of Distribution, ASICS Europe B.V. Hands-free scanning complements robotics CASE STUDY Online B2C order processing and returns are even more demanding than the B2B process for supporting the retail stores. For a distribution center like the ASICS EDC, this means huge volumes of returns every day with enormous scanning requirements. Each returned package",
    "embedding_index": 33
  },
  {
    "pdf_name": "CS ASICS_EN (Not allowed to use on social)",
    "chunk_id": 4,
    "text": "must be opened, the goods inspected and - if the return is in order and received within the required period - put back into storage and the proper information sent so the customer’s account can be updated. In order for this to happen error- free, the scanners must capture data accurately and reliably. ProGlove supports ASICS in making the time-consuming processing of returns faster and more efficient. Employees are able to work hands free, easily picking up the packages and the tools to unpack them, while seamlessly operating the terminals. This would be impossible with the limitations of a handheld barcode scannerMastering the high demands of e-commerce orders and returns High turnover and the shortage of skilled workers are major problems for ASICS and it raises the important question: How can we retain our employees and attract new ones? Innovative tools like ProGlove's scanners make work easier, contribute to higher employee satisfaction and improve performance by 15-20%. Additionally, employees know when a warehouse has adopted superior technology, and it feeds word of mouth, which is an incredibly strong influencer. This is how employee-centric technology gives ASICS a decisive edge as an employer. Differentiation in the competition for labor To keep",
    "embedding_index": 34
  },
  {
    "pdf_name": "CS ASICS_EN (Not allowed to use on social)",
    "chunk_id": 5,
    "text": "up with increasing demand, ASICS needed to take a close look at labor-intensive picking and packing. For these analytics, the ProGlove MARK scanners and the ProGlove Gateway provide fundamental data that goes well beyond just barcode content. Now, the company can combine all data from the ProGlove devices and conduct meaningful process analyses. The gateway can also be used to add, change, or remove functions as required. In this way, ASICS brings together data from the scanners, robotics, and the WMS for analytical evaluation. This creates the basis for optimizing every process step including warehouse design.Analytics and process optimizationThe \"units picked per hour\" (UPH) factor is the metric of speed. It measures how many items an employee picks per hour. With ProGlove’s MARK scanners, ASICS was able to increase its UPH rate by 27%. This not only reduced pure scanning time, it also helped improve overall process efficiency.Increasing the pick rate CASE STUDY Benefits Yield and ROI depend on real-time inventory management. By using ProGlove scanners, ASICS was able to improve the quality and efficiency of its warehouse processes and achieve a 27% improvement in overall productivity. A 27% increase in overall productivity The availability and reliability of scan data",
    "embedding_index": 35
  },
  {
    "pdf_name": "CS ASICS_EN (Not allowed to use on social)",
    "chunk_id": 6,
    "text": "is of paramount importance to ASICS. The company was able to drastically reduce its scanning errors. More accurate scans combined with more barcodes scanned per shift thus lead to less rescans and less workflow interruptions.Minimizing errors ProGlove's innovative barcode scanner and technology allowed ASICS to capture not only product information, but also data from the shop floor, such as product location. All this is integrated within the WMS and synchronized with picking lists. This integration has enabled ASICS to meet the challenges of the new retail and e-commerce landscape, making processes such as forecasting and inventory management much more accurate.Integration with the inventory management system",
    "embedding_index": 36
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 0,
    "text": "Innovating human-centered productivityLOGISTICS • Essential to the economy 3 • 3 challenges that are driving the need for warehouse productivity 4 • Productivity starts with ProGlove 6 • Safer, less stressful, more productive work environment 8 • Enhanced mobility 9 • ProGlove optimizes warehouse processes 10 • Picking 11 • Sorting 12 • Incoming goods/outgoing goods 13 • Process quality control 14 • Cross Docking 15 • AGV/AMG Collaboration 16 • ProGlove Success Story 17 • DHL Success Story 18 • GXO Success Story 19 • Planzer Success Story 20 • Kickstart your productivity 21CONTENT 3Essential to the economy Bringing goods and services to market is es - sential to the functioning of our economy. Whether it’s produce, manufactured goods, or simply moving products from place to place, lo - gistics and transportation are the engines that drive commerce. The logistics and transportation industries are critical to promoting trade and ensuring smooth operations. However, escalating customer de - mand, and the costs of meeting that demand, along with everchanging legislation are creating enormous hurdles. It is essential that these in - dustries find immediate ways to increase effi - ciency and productivity. The warehouses and distribution centers are key leverage",
    "embedding_index": 37
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 1,
    "text": "points as logistics and transporta - tion look to overcome these hurdles and forge greater success. ProGlove’s vision and innova - tion are ushering in a new age of productivity, predictability, and profitability. 43 challenges that are driving the need for warehouse productivity 1. Improving customer satisfaction The ware - house is measured by meeting contractual specifications for OTIF shipments, which is the essential KPI. Customer satisfaction is the goal. The ability to meet those obligations in changing times can be enhanced by increasing the speed and accuracy of barcode scanning, Scanning is part of every process and any improvements have great impact. The faster and more accurate the scans, the greater the increase in both effi - ciency and productivity. 2. Flexibility on the shopfloor Demand rises and falls, supply chains can be erratic. The ware - house needs flexibility to respond and never stumble. To embed flexibility into the DNA of the warehouse, operations must first establish and incorporate dynamic, mobile processes. Sta - tionary processes and devices are an increasing impediment. The mobility and technology of barcode scanning improves the speed and accu - racy of easy documentation, and provides better, real-time data to aid inventory management.",
    "embedding_index": 38
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 2,
    "text": "4 553. Increasing worker safety The reality of the shop floor is that there are significant opportunities to increase worker safety, especially with barcode scanning, where current tools may be heavy, tied to a stationary device, and require repetitive motion. Wearable, lightweight, ergonomic scanners eliminate these issues and ensure that workers always have both hands available. Acoustic, visual, and haptic feedback on the same device boosts productivity. 6Productivity starts with ProGlove ProGlove’s innovation solves today’s productivity problems today delivering immediate and significant improvements to processes and overall warehouse performance. Adoption of ProGlove’s lightweight, ergonomic barcode scanners is almost instantaneous - it is almost instinctual. Notably, our devices enjoy a 90+% worker satisfaction rating. 7 CUSTOMERS REPORT 27% increase in productivity33% reduction in errors 6 seconds saved per scan 7 8ProGlove scanners are lightweight, ergonomically designed, and wearable. Which means that workers always have both hands free, all the time. The repetitive motion required for handheld scanners is gone, as is the weight. Whether on the floor, a ladder or a forklift, workers are safer and less stressed. Safer, less stressful, more productive work environment 8ProGlove’s clear ergonomic value translates into reduced physical strain and improved worker comfort, ultimately enhancing productivity",
    "embedding_index": 39
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 3,
    "text": "and satisfaction. Moreover, hands- free documentation minimizes distractions and allows workers to fully concentrate. Our wearable scanners create a safer working environment and reduce the risk of accidents or errors. ProGlove wearable scanners facilitate continuous workflows, leading to improved process quality and simpler documentation. By seamlessly integrating with existing systems, our scanners streamline the documentation process. The devices provides real-time guidance and feedback to workers, ensuring they follow the correct procedures and reducing the risk of errors or inconsistencies. 9 Enhanced mobility With our wearable scanners, workers can stay on the move and accomplish more in less time, ultimately boosting the productivity and effectiveness of the entire workforce. Our wearable scanners are designed to optimize mobility by allowing workers to move freely between stations and throughout the plant. By eliminating the constraints of traditional scanning methods or stationary workstations, our devices enable workers to carry out their tasks with greater flexibility and adaptability, and transition between different job sites or workstations without wasting time on unnecessary walks or delays. Additionally, new data from the shop floor, available with ProGlove scanners, provides information to streamline all processes and layout. 10ProGlove optimizes warehouse processes 1 2 3Picking Sorting 4 5 6Process Quality",
    "embedding_index": 40
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 4,
    "text": "Control Cross-Docking AGV/AMG collaboration Incoming goods / Outgoing goods 11Picking1 Challenge Warehouses store products high, low, and everything in-between. Space, and how that space is used, is a critical success factor in locating, scanning, and picking the right product to ship. Often, the worker is on a ladder or driving a forklift, each lifting the worker, but leaving them with the same constraints of handheld scanners – weight, repetitive motion, and awkward movements. Solution High, low, or tightly packed, whether on foot, a ladder, or a forklift, ProGlove’s lightweight, ergonomic wearable scanners enhance any mobility initiative. Our scanners streamline the scanning for easier documentation, take a photo to report damages, and transmit two-way communications. Workers always have both hands free. Benefits 4 seconds per scan saved Adopted by 11 1212Sorting2 Challenge Logistics centers experience a wide range of demand, which means that efficiency is a paramount concern, especially in sorting. This is a price-sensitive and competitive marketplace and all orders must be shipped to contractual obligations, no matter the order size, complexity, or urgency. Solution With ProGlove’s haptic, audible, and visual feedback, workers are quickly able to find, document, pick, and sort the correct products. The devices flag any scanning",
    "embedding_index": 41
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 5,
    "text": "errors improving loading speed and guiding quality. Two-way communications alerts the worker to high priority orders and picks. Workers are mobile and hands-free – documentation is easy and thorough. Benefits 20% productivity increase Elimination of unproductive scans 10.000h/year time savings Adopted by Deutsche Post 13133 Challenge Increasing demand and increasing returns means that both Receiving and Shipping are operating at or beyond capacity. Quality control becomes an overarching concern. Asking workers to do their same jobs with the same tools, only faster, erodes the time and attention needed for each process. Quality control is not immune. Solution ProGlove scanners are faster, opening up more time for inspection and quality control. They are more accurate, can read multiple barcodes at one time, and the data is easily transmitted to the WMS. They timestamp for complete documentation, and can take a photo of damaged goods. Direct feedback via the scanner, via optic, acoustic, and haptic cues, gives interactive, real-time direction. Benefits 40 min/day saved 50% loading time reduction for shop floor drivers Adopted byIncoming goods/ outgoing goods 1414Process quality control 4 Challenge The efficiency and productivity of the warehouse is often undermined by the inefficiency of processes. To date there has been",
    "embedding_index": 42
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 6,
    "text": "little transparency into the actual movement of workers and goods, and the efficacy of the processes they repeat multiple times every day. Solution ProGlove’s INSIGHT provides a new window into the shop floor, and every process that every worker executes. Data from the fleet is analyzed and displayed in dashboards that scan performance to identify inefficiencies and bottlenecks, and track improvements. Additionally, our software enables operations to reconceive the physical environment to implement more logical and efficient workflows. Benefits Eliminate unproductive scans: up 6% time savings/day 100,000€ savings/year Adopted by 1515Cross-Docking 5 Challenge Operationally, unloading an inbound vehicle and loading them directly into an outbound vehicle may spare the expense of storage, but it compresses the time for all documentation and quality control processes. Workers need tools that increase dexterity, are fast, and very accurate. Solution ProGlove’s wearable scanners shave seconds off every scan, while reducing errors. Workers and workflows are much more productive ensuring that the required documentation, including photos of damaged goods, is easy, high-quality, and transmitted to the WMS. Workers operate our devices without leaving the forklift, and always have both hands free. Two-way communications add to the speed and accuracy. Benefits 5 seconds faster per scan",
    "embedding_index": 43
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 7,
    "text": "Adopted by 1616AGV/AMG collaboration 6 Challenge Operations looks to technology and automation for breakthroughs in productivity. However, there is budget or priority for changing existing technology, such as the WMS. Autonomous automation is years away Solution “Collabomation” is the term we use to describe the smart combination of humans and robots, relying on each to do what they do best. AGVs and AMRs greatly ease the physical burden and work to ensure a smooth workflow. Workers with our wearable devices are much more productive because of their speed, range, and dexterity. The best news is that Collabomation is available today. Benefits 70,000 more parcels shipped per year >6x faster picking Adopted by 17 ProGlove Success Story 18Challenge The booming e-commerce business has caused a steep increase in shipment volumes. DHL needed to address this increase without reworking their shopfloor and their working areas. In particular, processing bulky goods at the dedicated terminal was a challenge (DHL called this Bulky Goods 2.0). Solution DHL equipped its employees with ProGlove scanners for full operator mobility as well as the, speed and accuracy of scanning. They can work at any point where the bulky goods arrive - they have all the tools they",
    "embedding_index": 44
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 8,
    "text": "need on the back of their hand. DHL workers now spend more time processing packages than walking the aisles. Result By making the entire Bulky Goods process mobile, faster, and more accurate, 4 seconds saved per scan • Processes are faster • No more stationery terminals • Reduced errors, stress, and travel time DHL \"Mobile scanning solutions such as ProGlove increase the transparency and the reliability of our services. In an industry where time is everything, it all comes down to shipping more, minimizing errors, and enhancing process quality..\" DR. SIMON DEYMAN Vice President Operations Parcel Hubs, DHL 19 \"We’re constantly exploring new technology that enhances the accuracy, efficiency and safety of our operations. Where we deploy wearable scanners, we can increase productivity up to 10% depending on the application, while delivering a better experience for our employees.\" RICHARD CAWSTON President, GXO Europe GXO Challenge As the world’s largest pure-play contract logistics provider. GXO fulfillment centers manage thousands of different products SKUs during peak seasonality. Scalability and flexibility required tools that enhance speed, accuracy, and worker safety. These tools must be easy to use and provide data directly (and easily) to the WMS. Solution ProGlove barcode scanners helped GXO achieve",
    "embedding_index": 45
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 9,
    "text": "new levels of efficiency by empowering workers to be more productive. Our scanners reduced the friction in workflows, by displaying real-time information about storage locations, product identifiers, and inventory levels. Data flows into the WMS. Fulfillment centers are able to respond to demand fluctuations while meeting all OTIF contractual obligations. Result GXO saved 6 seconds per pick, and gained 10% in productivity. They experienced a 75% reduction in errors per million units picked. 20Planzer Challenge Planzer’s warehouses abut railway platforms, and every morning approximately 25 cars of products arrive. They have 3 - 4 hours to complete receiving, documentation, and quality control. They urgently need tools that enable each worker to be faster, more accurate, and safer. Solution ProGlove scanners were an enormous improvement over heavy, handheld devices that were tethered to chargers. Data was not transmitted until the device was seated. Now, workers are safer - they don’t have to get off the forklift to scan, and they always have both hands free. Two-way communications brings them information they didn’t have before. Result Workers are less stressed and more satisfied. Processes are optimized - the increased scanning range has sped up documentation. With the information on the display, the",
    "embedding_index": 46
  },
  {
    "pdf_name": "Logistics_Brochure_2023_EN",
    "chunk_id": 10,
    "text": "picker always know what shelf and what product is next. JAN PFENNINGER Extended Management Board Member, Planzer \"We are constantly testing technologies that can simplify our processes and also make the everyday work more pleasant for our employees. ProGlove has now been rolled out in all our handling locations.\" 21Kickstart your productivity Take the ProGlove Challenge info@proglove.com www.proglove.comLet us show you, in your warehouse, the kind of productivity ProGlove delivers. 30 minutes, in your warehouse, with your workers, our scanners vs yours. We call it the ProGlove Challenge. There’s very little to lose and a lot of productivity to gain. 21",
    "embedding_index": 47
  },
  {
    "pdf_name": "Technical Specification_ProGlove MARK 3_October_2022",
    "chunk_id": 0,
    "text": "Technical Specification Product specifications are subject to change without notice. For updated version of product specifications visit: www.proglov e.com Workaround GmbH, Rupert -Mayer -Str. 44, Building 64.08, 81379 München October 2022 ProGlove MARK 3 (multi range) WIRELESS COMMUNICATION BLUETOOTH RADIO Supports Bluetooth Low Energy 4.0, 4.1, 4.2, 5.0 FREQUENCY RANGE MAX RADIO -FREQU. POWER TRANSMITTED Frequency band used BLE: 2400 -2483.5 MHz < 20dBm TRANSMISSION RANGE 3rd party device ProGlove Gateway Free field: 40 m (131 ft )** Free field: 70 m (230 ft )** Indoor: 10 -20 m (33 -66 ft)** Indoor: 30 -40 m (100 -130 ft)** **may decrease in industrial environments (e.g. due to walls, metal shelving, mac hines) BARCODE DECODING CAPABILITIES 1D Auto decodes all standard 1D codes including GS1 DataBar linear codes et al. 2D PDF417, MicroPDF417, Data matrix, QR Code, Micro QR Code, Aztec, MaxiCode, et al. POSTAL US PostNet, US Planet, UK Postal, Australia Postal, Japan Postal, Dutch Postal (KIX) et Al. ELECTRICAL PROPERTIES BATTERY 670 mAh, Lithium polymer (rechargeable) CHARGING TIME 2 hours with ProGlove Charging Station OPERATING TIME / SCANS approx. 12000 scans depending on the applicati on and environmental conditions MECHANICAL PROPERTIES DIMENSIONS 50 x 45 x 17 mm (1.47",
    "embedding_index": 48
  },
  {
    "pdf_name": "Technical Specification_ProGlove MARK 3_October_2022",
    "chunk_id": 1,
    "text": "x 1.77 x 0.67 in) WEIGHT 39 g (1. 38 oz) ENVIRONMENTAL CONDITIONS DROP RESISTANCE Resists several drops from 2 m (6.5 ft) onto concrete TUMBLES 2000 tumbles from 0.5 m PROTECTION AGAINST DUST AND WATER IP 65 TEMPERATURE Operating Temperature : -20°C - 50°C ( -4°F – 122°F) Charging Temperature: 5°C - 40°C (41°F – 104°F) Storage Temperature: -20°C - 60°C ( -4°F – 140°F) HUMIDITY 5% - 95% non condensing ELECTROSTATIC DISCHARGE (ESD) ±8kVdc air discharge ±4kVdc contact discharge INTERFACES BLUETOOTH HID Profiles ANDROID HID, Insight Mobile (Android) (App/SDK) IOS HID, Insight Mobile (iOS) (SDK) USB ProGlove Gateway SCANNER PROPERTIES RESOLUTION 2688 x 1520 READING FIELD OF VIEW Horizontal: 37°, vertical: 21° SKEW, PITCH & ROLL Skew tolerance: ±60° Pitch tolerance: ±60° Roll tolerance: 360° AMBIENT LIGHT 0 – 107,639 lux AIMER Green Laser 520nm UTILITIES & ACCESSORIES* CONFIGURATION & DEVICE MANAGEMENT https://insight.proglove.com DIGITAL DOCUMENTATION https://docs.proglove.com ANDROID INTEGRATION Insight Mobile : Provides a full featured integration for Android enterprise applications . GATEWAY INTEGRATION ProGlove Gateway: Hardware connector to enable the full capabilities of the ProGlove Ecosystem via USB -Interface. TRIGGER Scanner can be triggered only with ProGlove wearables (Hand Strap, Index -Trigger, Reel et al.) *More Information on",
    "embedding_index": 49
  },
  {
    "pdf_name": "Technical Specification_ProGlove MARK 3_October_2022",
    "chunk_id": 2,
    "text": "www.proglove.com SCAN RANGES Minimum distance determined by symbol length, scan -angle and environmental conditions (e.g. lightning, printing quality, contrast et al.). MULTI RANGE 3 mil Code 39 Near Distance: 2.7 in./6.9 cm; Far Distance: 16.2 in./41.1 cm 5 mil Code 39 Near Distance: 2.5 in./6.4 cm; Far Distance: 26.6 in./67.6 cm 5 mil PDF417 Near Distance: 2.8 in./7.1 cm; Far Distance: 19.6 in./49.8 cm 6.7 mil PDF417 Near Distance: 2.6 in./6.6 cm; Far Distance: 25.6 in./65.0 cm 10 mil DataMatix Near Distance: 2.2 in./5.6 cm; Far Distance: 27.1 in./68.8 cm 100% UPCA (13 mil) Near Distance: 2.5 in./6.4 cm; Far Distance: 71 in./180 cm 15 mil Code 128 Near Distance: 7.2 in./18.2 cm; Far Distance: 72 in./182.9 cm 20 mil Code 39 Far Distance: 109 in./276.9 cm 55 mil Code 39 Far Distance: 293 in./744.2 cm 100 mil Code 39 Far Distance: 554 in./1407.2 cm 100 mil DataMatrix Far Distance: 270 in./685.8 cm WARRANTY & SLA WARRANTY 12 month s factory warranty PROGLOVE CARE 36 and 60 month s maintenance contract s available. For more information please contact your ProGlove representative or visit https://proglove.com SAFETY & REGULATORY RADIO AND ELECTROMAGNETIC COMPATIBILITY EU: 2014/53/EU Radio Equipment Directive (RED) FCC ID: 2AOJL",
    "embedding_index": 50
  },
  {
    "pdf_name": "Technical Specification_ProGlove MARK 3_October_2022",
    "chunk_id": 3,
    "text": "- MARK -3 IC: 23450 -MARK3 ELECTRICAL SAFETY EU: acc. to 2014/53/EU Radio Equipment Directive (RED) EN 62368 -1:2014 + A11:2017 INTERNATIONAL: IEC 62368 -1:2014 US: UL 6 2368 -1 and CAN/CSA C22.2 No. 6 2368 -1 LASER CLASSIFICATION Multi range: According to EN 60825 -1: 2014 and IEC 60825 -1 (Ed. 3.0) Laser class 2 device. Caution Laser Radiation - Do not stare into beam. ENVIRONMENTAL RoHS Directive 2011/65/EU; Amendment 2015/863, REACH SVHC 1907/2006, WEEE COUNTRY CERTIFICATION Regulatory markings are affixed to the device, indicating that the radio modules are approved for use in the following regions: European Economic Area*, Canada, United States of America, United Mexican States, China. Detailed information on the regulatory markings can be found in the Declaration of Conformity (DoC) at www.proglove.com *CE is valid in the European Economic Area and additional countries: Austria, Belgium, Bulgaria, Croatia, Republic of Cyprus, Czech R epublic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, United Kingdom, Iceland, Liechtenstein, Switzerland and N orway.",
    "embedding_index": 51
  }
]